-   tags:
        - attack.discovery
        - attack.t1526
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: s3.amazonaws.com
            eventName:
                - ListBuckets
                - GetBucketCors
                - GetBucketInventoryConfiguration
                - GetBucketPublicAccessBlock
                - GetBucketMetricsConfiguration
                - GetBucketPolicy
                - GetBucketTagging
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: low
-   tags:
        - attack.discovery
        - attack.t1526
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName:
                - GetConsoleScreenshot
                - GetLaunchTemplateData
                - DescribeInstanceTypes
                - DescribeBundleTasks
                - DescribeInstanceAttribute
                - DescribeReplaceRootVolumeTasks
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: low
-   tags:
        - attack.discovery
        - attack.t1046
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName:
                - DescribeCarrierGateways
                - DescribeVpcEndpointConnectionNotifications
                - DescribeTransitGatewayMulticastDomains
                - DescribeClientVpnRoutes
                - DescribeDhcpOptions
                - GetTransitGatewayRouteTableAssociations
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: low
-   tags:
        - attack.discovery
        - attack.t1082
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_cloudwatch:
            eventSource: logs.amazonaws.com
            eventName:
                - GetQueryResults
                - GetLogRecord
                - DescribeLogGroups
                - DescribeLogStreams
                - DescribeSubscriptionFilters
                - ListTagsLogGroup
        selection_s3:
            eventSource: s3.amazonaws.com
            eventName: GetBucketLogging
        selection_ec2:
            eventSource: ec2.amazonaws.com
            eventName:
                - GetFlowLogsIntegrationTemplate
                - DescribeFlowLogs
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: (selection_cloudwatch or selection_s3 or selection_ec2) and selection_ioc_ip
    level: medium
-   tags:
        - attack.discovery
        - attack.t1082
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_ec2:
            eventSource: ec2.amazonaws.com
            eventName:
                - GetPasswordData
                - GetEbsEncryptionByDefault
                - GetEbsDefaultKmsKeyId
                - DescribeVolumes
                - DescribeVolumesModifications
                - DescribeSnapshotAttribute
                - DescribeSnapshotTierStatus
                - DescribeImages
        selection_s3:
            eventSource: s3.amazonaws.com
            eventName: GetBucketReplication
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: (selection_ec2 or selection_s3) and selection_ioc_ip
    level: medium
-   tags:
        - attack.discovery
        - attack.t1526
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ses.amazonaws.com
            eventName:
                - GetAccount
                - ListIdentities
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: low
-   tags:
        - attack.discovery
        - attack.t1526
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName:
                - DescribeRegions
                - DescribeAvailabilityZones
                - DescribeAccountAttributes
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: low
-   tags:
        - attack.discovery
        - attack.t1087
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: sts.amazonaws.com
            eventName: GetCallerIdentity
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
    level: medium
-   tags:
        - attack.discovery
        - attack.t1069.003
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
                - ListAttachedRolePolicies
                - ListRolePolicies
            errorCode:
                - AccessDenied
                - Client.UnauthorizedOperation
        selection_ioc_ip:
            sourceIPAddress: 50.82.94.112
        condition: selection and selection_ioc_ip
    level: high