-   tags:
        - attack.t1580
        - attack.t1619
    logsource:
        product: aws
        service: cloudtrail
    detection:
        secrets_manager_selection:
            eventName: ListSecrets
            eventSource: secretsmanager.amazonaws.com
        s3_bucket_selection:
            eventName: ListBuckets
            eventSource: s3.amazonaws.com
        s3_object_selection:
            eventName: ListObjects
            eventSource: s3.amazonaws.com
        selection_glacier:
            eventSource: glacier.amazonaws.com
            eventName: ListVaults
        selection_ioc_ip:
            sourceIPAddress:
                - 104.28.231.254
                - 148.252.146.75
                - 104.28.242.246
                - 104.28.200.1
                - 104.28.232.2
                - 104.28.200.6
        selection_ioc_ua:
            userAgent|contains:
                - python-requests/2.20.0 auth-aws-sigv4
        condition: (secrets_manager_selection or s3_bucket_selection or s3_object_selection or selection_glacier) and (selection_ioc_ip or selection_ioc_ua)
    level: medium
-   tags:
        - attack.t1087
        - attack.t1087.004
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName: GetUser
        selection_ioc_ip:
            sourceIPAddress:
                - 104.28.231.254
                - 148.252.146.75
                - 104.28.242.246
                - 104.28.200.1
                - 104.28.232.2
                - 104.28.200.6
        selection_ioc_ua:
            userAgent|contains:
                - python-requests/2.20.0 auth-aws-sigv4/0.7
                - python-requests/2.31.0 auth-aws-sigv4/0.7
                - python-requests/2.32.2 auth-aws-sigv4/0.7
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: low