-   tags:
        - attack.discovery
        - attack.t1069
        - attack.t1087
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_iam:
            eventSource: iam.amazonaws.com
            eventName:
                - 'Get*'
                - 'List*'
        selection_error:
            errorCode: 'Client.UnauthorizedOperation'
            errorMessage|contains: 'You are not authorized to perform this operation'
        condition: selection_iam and selection_error
    level: low
-   tags:
        - attack.credential_access
        - attack.t1528
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_iam:
            eventSource: iam.amazonaws.com
            eventName:
                - CreateAccessKey
                - UpdateAccessKey
                - DeleteAccessKey
        selection_error:
            errorCode: 'Client.UnauthorizedOperation'
            errorMessage|contains: 'You are not authorized to perform this operation'
        condition: selection_iam and selection_error
    level: high
-   tags:
        - attack.persistence
        - attack.privilege_escalation
        - attack.t1098
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_iam:
            eventSource: iam.amazonaws.com
            eventName:
                - CreateLoginProfile
                - PutRolePolicy
                - CreatePolicyVersion
        selection_error:
            errorCode: 'Client.UnauthorizedOperation'
            errorMessage|contains: 'You are not authorized to perform this operation'
        condition: selection_iam and selection_error
    level: high