-   title: AWS IAM User Creation - Potential Persistence
    status: experimental
    description: Detection of AWS IAM User creation, which could indicate an attempt to establish persistence by creating new users. This is commonly seen in unauthorized access incidents.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1136
        - attack.t1136.003
        - attack.persistence
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName: CreateUser
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
    falsepositives:
        - Legitimate user provisioning during normal operations.
    level: high
-   title: AWS EC2 Instance Creation - Potential Resource Hijacking
    status: experimental
    description: Detection of EC2 instance creation, which may be associated with resource hijacking attacks used for activities like crypto mining.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1496
        - attack.impact
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: RunInstances
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    falsepositives:
        - Legitimate EC2 instance creation for authorized workloads.
    level: high
-   title: Suspicious ListBuckets Request from Anomalous Geo Location and User-Agent
    status: experimental
    description: Detects an anomalous ListBuckets request from an Indonesian IP and an unfamiliar User-Agent (S3 Browser) within the victim's AWS environment, indicating possible unauthorized access and data discovery activity.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.discovery
        - attack.t1580
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: s3.amazonaws.com
            eventName: ListBuckets
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
    falsepositives:
        - Legitimate use of S3 Browser by unfamiliar users or administrators, though this should be rare in typical environments.
    level: low
-   title: AWS IAM PutUserPolicy Privilege Escalation Attempt
    status: experimental
    description: Detects attempts to escalate privileges by attaching user policies to an IAM user, which could be used by attackers to gain or maintain elevated access.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.privilege_escalation
        - attack.t1098
        - attack.t1098.003
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName: PutUserPolicy
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
    falsepositives:
        - Legitimate changes by administrators adding policies to users
    level: high
-   title: AWS IAM CreateAccessKey for Persistence
    status: experimental
    description: Detects the creation of new access keys, which may be used to maintain access to compromised accounts.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.persistence
        - attack.t1098
        - attack.t1098.001
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName: CreateAccessKey
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
    falsepositives:
        - Legitimate creation of access keys by administrators or users
    level: high
-   title: AWS S3 GetObject Collection Activity
    status: experimental
    description: Detects attempts to retrieve objects from S3 buckets, which could indicate suspicious data exfiltration or collection activities.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.collection
        - attack.t1530
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: s3.amazonaws.com
            eventName: GetObject
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
    falsepositives:
        - Legitimate data retrieval by users authorized to access objects
    level: medium
-   title: EC2 Key Pair Creation
    status: experimental
    description: Detection of AWS EC2 key pair creation, which can be used to gain access to EC2 instances.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1578
        - attack.t1578.002
        - attack.defense_evasion
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: CreateKeyPair
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    falsepositives:
        - Legitimate creation of new key pairs for infrastructure management.
    level: high
-   title: EC2 Security Group Creation
    status: experimental
    description: Detection of AWS EC2 security group creation, which can be used to configure network access for EC2 instances.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1578
        - attack.t1578.005
        - attack.defense_evasion
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: CreateSecurityGroup
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    falsepositives:
        - Legitimate creation of security groups as part of normal infrastructure management.
    level: high
-   title: EC2 Security Group Ingress Rule Authorization
    status: experimental
    description: Detection of AWS EC2 security group ingress rule authorization, which can allow network access to EC2 instances, including potentially dangerous configurations like opening TCP/22 (SSH) to all IPs.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1578
        - attack.t1578.005
        - attack.defense_evasion
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: AuthorizeSecurityGroupIngress
            requestParameters:
                ipProtocol: tcp
                fromPort: 22
                toPort: 22
                cidrIpv4: 0.0.0.0/0
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    falsepositives:
        - Legitimate configuration of security group ingress for SSH access, though this should be closely monitored.
    level: high
-   title: EC2 Instance Attribute Modification
    status: experimental
    description: Detection of modifications to AWS EC2 instance attributes, which can be used to evade defenses or modify instance configurations for malicious purposes.
    references:
        - https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/
    author: LLMCloudHunter
    date: 2024/09/10
    tags:
        - attack.t1578
        - attack.t1578.005
        - attack.defense_evasion
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: ModifyInstanceAttribute
        selection_ioc_ip:
            sourceIPAddress: 182.1.229.252
        selection_ioc_ua:
            userAgent|contains:
                - S3 Browser 9.5.5
                - s3browser.com
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    falsepositives:
        - Legitimate modifications to EC2 instance attributes for operational purposes.
    level: high